<a href="https://colab.research.google.com/github/SS012022/Azhar_notebooks/blob/main/Sep_17_24.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas

Pandas is open source python library built on top of numpy
what we can do with pandas:
1. Data analyze
2. Data cleaning
3. handling mising values
4. insert or delete columns in database (data)

there are two objects in pnadas:
1.series: one dimensional array to store any type of data,labelled array we can create
2. Dataframe : like two dimensional array.

In [1]:
import pandas as pd

In [4]:
seri=pd.Series()
print(seri)

Series([], dtype: object)

In [5]:
seri=pd.Series([13,56,78,21,45,36])
seri

0    13
1    56
2    78
3    21
4    45
5    36
dtype: int64

In [9]:
seri=pd.Series([23,65,34],index=["row1","row2","row3"])
seri

row1    23
row2    65
row3    34
dtype: int64

In [11]:
seri=pd.Series([10,20,30],index=["ten","twenty","thirty"],name="tens")
seri

ten       10
twenty    20
thirty    30
Name: tens, dtype: int64

In [13]:
seri=pd.Series([2,3,4,5,5,6],dtype="float")
seri

0    2.0
1    3.0
2    4.0
3    5.0
4    5.0
5    6.0
dtype: float64

In [14]:
seri=pd.Series([4.6,6.5,2.4,7.8])
seri

0    4.6
1    6.5
2    2.4
3    7.8
dtype: float64

In [ ]:
# create a series of your 5 Employee name
# create a series of salary of that employees
# create a series of jobs of that employees.

**bold text** Homework
# create series from scalar variable
# create serise from arange

# create series from linspace
# create series from dictionary
# convert series datatype from float to int
# use nump in pandas

roll , name , subject
1     aaa    java
2     www    c
3     gyy    java